public class Test3 {
    /*
      记忆
     1. 一个Java源文件中可以定义多个class。
     2. public的类不是必须的，可以没有。
     3. 在源文件中只要有一个class的定义，那么必然会有对应生成一个class文件。
     4. public的类可以没有，但如果有的话，public修饰的类必须和源文件名保持一致。
     5. public的类有也只能有一个。
    */
    /*
    标识符可以标识
        (命名规则）
    类名
    方法名
    变量名
    常量口
    1.标识符只能由数字、字母、下划线“—”、美元符号“￥”组成，不能含有其他符号.
    2.标识符不能以数字开始.
    3.Java关键字和保留子不能作为标识符.
    4.标识符严格区分大小写.
    5.标识符理论上没有长度限制.
    （凡是程序员自己有权利命名的的单词都是标识符）
        （命名规范）
    1.见名知意
    2.遵循驼峰命名方式（一高一低）
    BiaoShiFuTest
    3.类名、接口名首字母大写，后面每个单词小写
    studentTest
    4.变量名、方法名首字母小写，后面每个单词大写
    age（aGE符合)
    5.所有"常量"名：全部大写，并且每一个单词和单词之间采用下划线衔接。
    USER_AGE: 用户年龄

     */
    /*
    关键字
    Java语言中所有的关键字都是小写
     */

    public static void main(String[] args){

        int l = 100 ;
        int y = 20;
    }
}
